# Solución Examen UD1 - Parte 2

Si tenemos un dataframe df con columnas age, salary, sex y queremos:

1. Mostrar aquellos individuos menores de 30 años o con salario igual o superior a 25000 euros,

2. Añadir una nueva columna numérica al dataframe llamada salary_irpf que se corresponda con el 20% de su sueldo, entonces escribiremos:


3. Si tenemos un dataframe df con columnas age, salary, sex y queremos saber cuél es la media de edad de nuestros individuos, entonces escribiremos:


4. Si tenemos un dataframe df con columnas age, salary, sex y queremos borrar del mismo la columna sex, entonces escribiremos:


5. Si tenemos un dataframe df con columnas age, salary, sex y queremos conocer el salario máximo por sexo, entonces escribiremos:


6. Si tenemos un dataframe df con columnas age, salary, sex y queremos recuperar las 3 primeras filas y las 3 últimas de la columna salary en una única instrucción, entonces escribiremos:

7. Si tenemos un dataframe df con columnas age, salary, sex y queremos añadir borrar todas las filas que tengan valores nulos en la columna salary, entonces escribiremos:

In [9]:
import pandas as pd
df = pd.read_csv("data/demo-examen-parte2.csv")

In [10]:
df

   age  salary     sex
0   58   36000    male
1   23   18000  female
2   31   23000  female
3   28   40000  female
4   46   50000    male
5   18   15000    male
6   38   38000  female
7   40   29000    male

In [11]:
print(df[(df["age"]<30) | (df["salary"]>=25000)])

   age  salary     sex
0   58   36000    male
1   23   18000  female
3   28   40000  female
4   46   50000    male
5   18   15000    male
6   38   38000  female
7   40   29000    male

In [12]:
df["salary_irpf"]=df["salary"]*0.2
df

   age  salary     sex  salary_irpf
0   58   36000    male       7200.0
1   23   18000  female       3600.0
2   31   23000  female       4600.0
3   28   40000  female       8000.0
4   46   50000    male      10000.0
5   18   15000    male       3000.0
6   38   38000  female       7600.0
7   40   29000    male       5800.0

In [13]:
df["age"].mean()

35.25

In [14]:
#df = df.drop(columns=["sex"])
df

   age  salary     sex  salary_irpf
0   58   36000    male       7200.0
1   23   18000  female       3600.0
2   31   23000  female       4600.0
3   28   40000  female       8000.0
4   46   50000    male      10000.0
5   18   15000    male       3000.0
6   38   38000  female       7600.0
7   40   29000    male       5800.0

In [15]:
df.groupby("sex").salary.max()

sex
female    40000
male      50000
Name: salary, dtype: int64

In [18]:
df.iloc[[0,1,2,-3,-2,-1],1]

0    36000
1    18000
2    23000
5    15000
6    38000
7    29000
Name: salary, dtype: int64

In [17]:
df.dropna(subset=['salary'])

   age  salary     sex  salary_irpf
0   58   36000    male       7200.0
1   23   18000  female       3600.0
2   31   23000  female       4600.0
3   28   40000  female       8000.0
4   46   50000    male      10000.0
5   18   15000    male       3000.0
6   38   38000  female       7600.0
7   40   29000    male       5800.0